Modulos/TecnoSpeed/NFSe/Arquivos/Templates/PUBLICSOFT/GerarToken.xml

<soapenv:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:urn="urn:index.GerarToken">
   <soapenv:Header>%s
      <token xsi:type="xsd:string">%s</token>
      <codigoCidade xsi:type="xsd:string">%s</codigoCidade>
   </soapenv:Header>
   <soapenv:Body>
      <urn:GerarToken soapenv:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/"/>
   </soapenv:Body>
</soapenv:Envelope>
